{
  "content_chunk": "The cyclic redundancy check codes are popularly employed in LANs and WANs for error correction. The principle of operation of CRC encoders and decoders can be better explained with the following examples. CRC is the most powerful and easy to implement technique.CRC is based on binary division. In CRC, a sequence of redundant bits, are appended to the end of data unit so that the resulting data unit becomes exactly divisible by a second, predetermined binary number. At the destination, the incoming data unit is divided by the same number. If at this step there is no remainder, the data unit is assumed to be correct and is therefore accepted. A remainder indicates that the data unit has been damaged in transit and therefore must be rejected. The binary number, which is (r+1) bit in length, can also be considered as the coefficients of a polynomial, called Generator Polynomial. PERFORMANCE OF CRC CRC is a very effective error detection technique. If the divisor is chosen according to the previously mentioned rules, its performance can be summarized as follows. CRC can detect all single-bit errors and double bit errors (three 1’s). CRC can detect any odd number of errors (X+1) and it can also detect all burst errors of less than the degree of the polynomial. 1. The Sender follows the given steps:   2.   The block unit is divided into k sections, and each of n bits.   3.   4.   5.   All the k sections are added together by using one's complement to get the sum.   The sum is complemented and it becomes the checksum field.   The original data and checksum field are sent across the network.   Checksum Checker A Checksum is verified at the receiving side. The receiver subdivides the incoming data into equal segments of n bits each, and all these segments are added together, and then this sum is complemented. If the complement of the sum is zero, then the data is accepted otherwise data is rejected. 1. The Receiver follows the given steps:   2.   The block unit is divided into k sections and each of n bits.   3.   4.   5.   All the k sections are added together by using one's complement algorithm to get the sum.   The sum is complemented.   If the result of the sum is zero, then the data is accepted otherwise the data is discarded.   Cyclic Redundancy Check (CRC) CRC is a redundancy error technique used to determine the error. Following are the steps used in CRC for error detection: - In CRC technique, a string of n 0s is appended to the data unit, and this n number is less than the number of bits in a predetermined number, known as division which is n+1 bits. - Secondly, the newly extended data is divided by a divisor using a process is known as binary division. The remainder generated from this division is known as CRC remainder. - Thirdly, the CRC remainder replaces the appended 0s at the end of the original data. This newly generated unit is sent to the receiver. - The receiver receives the data followed by the CRC remainder. The receiver will treat this whole unit as a single unit, and it is divided by the same divisor that was used to find the CRC remainder. If the resultant of this division is zero which means that it has no error, and the data is accepted. If the resultant of this division is not zero which means that the data consists of an error. Therefore, the data is discarded.",
  "rules": "- Follow the Markdown format for creating notes as shown in the example. \n - The heading of the content should be the title of the markdown file. \n - Create subheadings for each section. \n - Use numbered bullet points for each point.",
  "notes": "# CRC (Cyclic Redundancy Check) Encoder and Decoder \n- They are popularly employed in LANs and WANs for error correction. \n- Based on binary division - a sequence of redundant bits are appended to the end of the data unit so that the resulting data unit becomes exactly divisible by a predetermined binary number.\n- At destination, if there is no remainder, it is assumed to be correct. A remainder indicates data unit is damaged and therefore rejected. \n- The binary number (r+1 bits by length) can be considered coefficients of a polynomial, called Generator Polynomial. \n- It is very effective, since it can detect all single-bit errors and double bit errors, odd number of errors and also burst errors of lesser degree than the polynomial. \n- It consists of two components, a generator and a checker.\n  1. **CRC Generator**: uses modulo 2 division. n 0s are appended to the end if divisor contains n+1 units. The remainder generated is called CRC remainder which replaces the appended string of 0s with itself and the final string is sent across the network.\n  2. **CRC Checker:** performs modulo 2 division to the number received from generator by the same divisor, and data is accepted if remainder is zero. \n\n- **CRC Algorithm:**\n  1. Append a string of n 0s to the data unit, where n < the predetermined number of bits in the divisor (n+1 bits).\n  2. Perform binary division between the extended data and the divisor to obtain the CRC remainder.\n  3. Replace the appended 0s at the end of the original data with the CRC remainder.\n  4. Transmit the newly generated unit to the receiver.\n  5. Upon reception, treat the data and CRC remainder as a single unit and divide it by the same divisor used earlier to determine the CRC remainder."
}